perf/accounts.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    # path is relative to the location of the test script
    path: 'balances.csv'
    fields:
      - 'accountId'
      - 'balance'

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  # General Phases for all scenarios
  phases:
    - name: Ramp to 50
      duration: 30
      arrivalRate: 10
      rampTo: 50
    - name: Plain at 50
      duration: 60
      arrivalRate: 50
    - name: Ramp to 100
      duration: 30
      arrivalRate: 50
      rampTo: 100
    - name: Plain at 100
      duration: 60
      arrivalRate: 100

scenarios:
  # Scenario for Get Accounts V1
  - name: GET_Accounts_V1
    flow:
      - get:
          url: '/v1/accounts'

  # Scenario for Get Accounts V1.1
  - name: GET_Accounts_Version1.1
    flow:
      - get:
          url: '/v1.1/accounts'

  # Scenario for Get Accounts V2
  - name: GET_Accounts_V2
    flow:
      - get:
          url: '/v2/accounts'

  # Scenario for Put Account Balance V1
  - name: PUT_Account_Balance V1
    flow:
      - put:
          url: '/v1/accounts/{{ accountId }}/balance'
          json: 
            balance: '{{ balance }}'